src_doc/Catalogs/ОчередьЗаданийДокументооборота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОчередьЗаданийДокументооборота</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеудачныхПопытокВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПотока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияОзнакомления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗамещающиеИПомощники</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияСогласования</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияРегистрации</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияПодписания</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияУтверждения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДвухфакторнойАутентификации</v8:Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектыКонтейнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияИсполнения</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКонтейнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбработкиОбъектов</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_doc/InformationRegisters/ПротоколВыполненияЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПротоколВыполненияЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОчередьЗаданийДокументооборота</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/Catalogs/ОчередьЗаданийДокументооборота/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПредыдущийРежимСписка;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = ЗаголовокФормы();
	ОтборПоОшибкамСервер();

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборПоОшибкамСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПредставленияУзловОбмена = Новый Соответствие();
	
	ПредельноеОжиданиеВыполненияЗадания = Константы.ПредельноеОжиданиеВыполненияЗадания.Получить();
	ПредельноеОжиданиеВыполненияДолгогоЗадания = Константы.ПредельноеОжиданиеВыполненияДолгогоЗадания.Получить();
	
	ТекДата = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Для Каждого КлючИЗначение Из Строки Цикл
		
		ДанныеСтроки = КлючИЗначение.Значение.Данные;
		
		ДанныеСтроки.ЕстьПросрочка = Ложь;
		
		Если ДанныеСтроки.СтатусЗадания = Перечисления.СтатусыЗаданий.Завершено Тогда
			ДанныеСтроки.Ждет = 0;
		Иначе
			ДанныеСтроки.Ждет = Цел((ТекДата - ДанныеСтроки.МоментВремени) / 1000);
		КонецЕсли;
		
		ОписаниеТипа = Перечисления.ТипыЗаданий.ОписаниеТипаЗадания(ДанныеСтроки.Тип);
		
		ДанныеСтроки.ТипОчереди = Перечисления.ТипыЗаданий.СинонимТипаОчереди(ОписаниеТипа.ТипОчереди);
		ДанныеСтроки.Сеанс = ОписаниеТипа.Сеанс;
		
		ЭтоДолгие = (ДанныеСтроки.ТипОчереди = Перечисления.ТипыЗаданий.Долгие()
			Или ДанныеСтроки.ТипОчереди = Перечисления.ТипыЗаданий.ДолгиеМассовые());
		
		Если ДанныеСтроки.Сеанс = "Клиент" 
			И ДанныеСтроки.Ждет > ПредельноеОжиданиеВыполненияДолгогоЗадания Тогда  
			ДанныеСтроки.ЕстьПросрочка = Истина;
		ИначеЕсли ДанныеСтроки.Сеанс = "Сервер" 
			И ДанныеСтроки.Ждет > ПредельноеОжиданиеВыполненияЗадания Тогда  
			ДанныеСтроки.ЕстьПросрочка = Истина;
		ИначеЕсли ДанныеСтроки.Сеанс = "Сервер" И ЭтоДолгие
			И ДанныеСтроки.Ждет > ПредельноеОжиданиеВыполненияДолгогоЗадания Тогда  
			ДанныеСтроки.ЕстьПросрочка = Истина;
		КонецЕсли;
		

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработчикСписокПриАктивизацииСтроки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСписокПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ИсторияВыполнения = "";
		Возврат;
	КонецЕсли;	
	
	ЕстьКПринудительнойОбработке = Ложь;
	РежимОтладки = ОбщегоНазначенияКлиентСервер.РежимОтладки();
	
	МассивВыделенных = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		МассивВыделенных.Добавить(ВыделеннаяСтрока);
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если ДанныеСтроки <> Неопределено
			И СтатусТребуетОбработки(ДанныеСтроки.СтатусЗадания)
			И (ДанныеСтроки.ЕстьПросрочка Или РежимОтладки) Тогда
			
			ЕстьКПринудительнойОбработке = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ИсторияВыполнения = ПрочитатьИсторию(МассивВыделенных);
	
	Элементы.СброситьОшибкиПраво.Доступность = (ТекущиеДанные.НеудачныхПопытокВыполнения >= 3);
	Элементы.СброситьОшибки.Доступность = (ТекущиеДанные.НеудачныхПопытокВыполнения >= 3);
	Элементы.ОбработатьПринудительноПраво.Доступность = ЕстьКПринудительнойОбработке;
	Элементы.ОбработатьПринудительно.Доступность = ЕстьКПринудительнойОбработке;

КонецПроцедуры	

&НаКлиенте
Процедура СброситьОшибки(Команда)
	
	ЗаданияДляОбработки = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл

		ЗаданияДляОбработки.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	

	Обработано = 0;
	СброситьОшибкиСервер(ЗаданияДляОбработки, Обработано);
	
	ОбновитьРеализация();
	
	ПоказатьОповещениеПользователя(
		СтрШаблон(НСтр("ru = 'Сброшен признак наличия ошибок у %1 заданий'"), Обработано));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПринудительно(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДляОбработкиВДругихУзлах = 0;
	ВсегоУспешно = 0;
	ВсегоОшибок = 0;
	СколькоВыделено = Элементы.Список.ВыделенныеСтроки.Количество();
	
	Если СколькоВыделено = 0 Тогда
		Возврат;
	КонецЕсли;

	#Если ВебКлиент Тогда
		
		Если СколькоВыделено = 1 И Элементы.Список.ТекущиеДанные.Сеанс = "Клиент"Тогда
			
			ПоказатьПредупреждение(, НСтр("ru = 'Для задания с ""Сеанс"" = ""Клиент"" 
			|эту операцию можно выполнить только в тонком клиенте в Windows'"));
			Возврат;
		КонецЕсли;	
		
	#КонецЕсли
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		

		ТекЗадание = ДанныеСтроки.Ссылка;
		Если ДанныеСтроки.Сеанс = "Сервер" Тогда
			
			ЗаданиеЗавершеноУспешно = Ложь;
			БылаОшибка = Ложь;
			
			ПараметрыЗаданияДляОбработки = ПараметрыЗаданияДляОбработки();
			ЗаполнитьЗначенияСвойств(ПараметрыЗаданияДляОбработки, ДанныеСтроки);
			ПараметрыЗаданияДляОбработки.Задание = ТекЗадание;
			
			ОбработатьПринудительноСервер(
				ПараметрыЗаданияДляОбработки,
				ЗаданиеЗавершеноУспешно,
				БылаОшибка,
				УникальныйИдентификатор);
				
			Если ЗаданиеЗавершеноУспешно Тогда
				ВсегоУспешно = ВсегоУспешно + 1;
			КонецЕсли;
				
			Если БылаОшибка Тогда	
				ВсегоОшибок = ВсегоОшибок + 1;
			КонецЕсли;	
				
		ИначеЕсли ДанныеСтроки.Сеанс = "Клиент" Тогда
			
			ЗаданияДляОбработки 
			= ДиспетчерОбработкиОчередиЗаданийВызовСервера.ЗаданияДляОбработкиНаКлиенте(
				1, ТекЗадание);
			
			Для Каждого ОписаниеЗадания Из ЗаданияДляОбработки Цикл
				
				ЗаданиеЗавершено = Ложь;
				
				ОписаниеЗадания.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
				ДиспетчерОбработкиОчередиЗаданийКлиент.ОбработатьОдноЗадание(
					ОписаниеЗадания, ЗаданиеЗавершено);
				
				Если ЗаданиеЗавершено Тогда
					ВсегоУспешно = ВсегоУспешно + 1;
				Иначе	
					ВсегоОшибок = ВсегоОшибок + 1;
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;		
			
	КонецЦикла;	
	
	ОбновитьРеализация();
	
	ТекстСообщения = "";
	Если ДляОбработкиВДругихУзлах = СколькоВыделено Тогда
		
		ТекстСообщения = ТекстСообщенияОбработкаВДругихУзлах(ДляОбработкиВДругихУзлах);
		
	ИначеЕсли СколькоВыделено = 1 Тогда
		
		Если ВсегоУспешно > 0 Тогда 
			ТекстСообщения = Нстр("ru = 'Задание выполнено'");
		ИначеЕсли ВсегоОшибок <> 0 Тогда
			ТекстСообщения = Нстр("ru = 'Задание не выполнено. 
			|Текст ошибки можно посмотреть в истории выполнения (справа).'");
		КонецЕсли;
			 
	Иначе	
		
		ВсегоОтработано = ВсегоУспешно + ВсегоОшибок;
		Если ВсегоОтработано <> 0 Тогда
			
			Если ВсегоОшибок = 0 Тогда
				ТекстСообщения = СтрШаблон(Нстр("ru = 'Задания выполнены (%1 шт)'"), ВсегоУспешно);
			Иначе
				ТекстСообщения = СтрШаблон(Нстр("ru = 'Задания выполнены успешно: %1 шт, с ошибками: %2 шт.
				|Текст ошибок можно посмотреть в истории выполнения (справа).'"), 
					ВсегоУспешно, ВсегоОшибок);
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьРеализация();
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОшибкам(Команда)
	
	Если Не ЕстьОтборПоОшибкам Тогда
		ПредыдущийРежимСписка = Элементы.Список.Отображение;
	КонецЕсли;	
	
	ЕстьОтборПоОшибкам = Не ЕстьОтборПоОшибкам; 
	
	ЕстьОтборНевыполненные = Ложь;
	
	Если ЕстьОтборПоОшибкам Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	ИначеЕсли ПредыдущийРежимСписка <> Неопределено Тогда	
		Элементы.Список.Отображение = ПредыдущийРежимСписка;
	КонецЕсли;	
	
	ОтборПоОшибкамСервер();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПрочитатьИсторию(МассивВыделенных)
	
	ПротоколВесь = "";
	ВсегоВыделено = МассивВыделенных.Количество();
	
	МассивСтроки = Новый Массив;
	
	Для Каждого ЗаданиеСсылка Из МассивВыделенных Цикл
		
		Протокол = РегистрыСведений.ПротоколВыполненияЗаданий.ПрочитатьЛог(ЗаданиеСсылка);
		НавСсылка = ПолучитьНавигационнуюСсылку(ЗаданиеСсылка);
		
		Если МассивСтроки.Количество() <> 0 Тогда
			МассивСтроки.Добавить(Символы.ВК + Символы.ВК);
		КонецЕсли;
		
		Если ВсегоВыделено > 1 Тогда
			МассивСтроки.Добавить(НавСсылка + Символы.ВК + Строка(ЗаданиеСсылка) + Символы.ВК + Протокол);
		Иначе
			МассивСтроки.Добавить(Протокол);
		КонецЕсли;
			
	КонецЦикла;	
	
	ПротоколВесь = СтрСоединить(МассивСтроки);
	
	Возврат ПротоколВесь;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СброситьОшибкиСервер(МассивВыделенных, Обработано)
	
	Для Каждого ЗаданиеСсылка Из МассивВыделенных Цикл
		
		Попытка
			
			ЗаданиеОбъект = ЗаданиеСсылка.ПолучитьОбъект();
			
			Если ЗаданиеОбъект.СтатусЗадания = Перечисления.СтатусыЗаданий.ОшибкаВыполнения Тогда
				
				ЗаданиеОбъект.СтатусЗадания = Перечисления.СтатусыЗаданий.Выполняется;
				ЗаданиеОбъект.НеудачныхПопытокВыполнения = 0;
				
				ЗаданиеОбъект.Записать();
				Обработано = Обработано + 1;
			
			КонецЕсли;
			
		Исключение
			
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			УровеньВажностиСобытия = УровеньЖурналаРегистрации.Ошибка;

			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Очередь заданий.СброситьОшибки.'", КодОсновногоЯзыка),
				УровеньВажностиСобытия, , , ТекстСообщения);
			
		КонецПопытки;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыЗаданияДляОбработки()
	
	Возврат Новый Структура(
		"Задание,
		|Тип,
		|ПредметЗадания,
		|Родитель,
		|МоментВремени,
		|НеудачныхПопытокВыполнения");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьПринудительноСервер(
	ПараметрыЗадания, ЗаданиеЗавершеноУспешно, БылаОшибка, УникальныйИдентификатор)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КоличествоПопытокОбработки 
		= ДиспетчерОбработкиОчередиЗаданийПолныеПрава.КоличествоПопытокВыполненияЗаданий();
	
	СтатусЗадания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗадания.Задание, "СтатусЗадания");	
	БылиБлокировки = Ложь;
	
	Если СтатусТребуетОбработки(СтатусЗадания) Тогда
		ДиспетчерОбработкиОчередиЗаданийПолныеПрава.ОбработатьОдноЗадание(
			ПараметрыЗадания, КоличествоПопытокОбработки, 0, ЗаданиеЗавершеноУспешно, БылаОшибка, БылиБлокировки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРеализация()
	
	Заголовок = ЗаголовокФормы();
	Элементы.Список.Обновить();
	ОбработчикСписокПриАктивизацииСтроки();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаголовокФормы()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Всего = 0;
	Завершенные = 0;
	Ошибок = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(КОЛИЧЕСТВО(ОчередьЗаданийДокументооборота.Ссылка), 0) КАК Всего
		|ИЗ
		|	Справочник.ОчередьЗаданийДокументооборота КАК ОчередьЗаданийДокументооборота
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(КОЛИЧЕСТВО(ОчередьЗаданийДокументооборота.Ссылка), 0) КАК Завершенные
		|ИЗ
		|	Справочник.ОчередьЗаданийДокументооборота КАК ОчередьЗаданийДокументооборота
		|ГДЕ
		|	ОчередьЗаданийДокументооборота.СтатусЗадания = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданий.Завершено)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(КОЛИЧЕСТВО(ОчередьЗаданийДокументооборота.Ссылка), 0) КАК Ошибок
		|ИЗ
		|	Справочник.ОчередьЗаданийДокументооборота КАК ОчередьЗаданийДокументооборота
		|ГДЕ
		|	ОчередьЗаданийДокументооборота.СтатусЗадания = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданий.ОшибкаВыполнения)";
		
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет(); // Массив из РезультатЗапроса
	
	Выборка = МассивРезультатовЗапроса[0].Выбрать();
	Выборка.Следующий();
	Всего = Выборка.Всего;
	
	Выборка = МассивРезультатовЗапроса[1].Выбрать();
	Выборка.Следующий();
	Завершенные = Выборка.Завершенные;

	Выборка = МассивРезультатовЗапроса[2].Выбрать();
	Выборка.Следующий();
	Ошибок = Выборка.Ошибок;
	
	// заголовок сформируем
	ТекстЗаголовка = СтрШаблон(
		НСтр("ru = 'Очередь заданий (Всего - %1 / Завершенные - %2 / Ошибок - %3)'"),
		Всего, Завершенные, Ошибок);
	
	Возврат ТекстЗаголовка
	
КонецФункции

&НаСервере
Процедура ОтборПоОшибкамСервер()

	Элементы.ФормаОтборПоОшибкам.Пометка = ЕстьОтборПоОшибкам;
	
	Если ЕстьОтборПоОшибкам Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;	
	
	Если ЕстьОтборПоОшибкам Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "НеудачныхПопытокВыполнения", 0, ВидСравненияКомпоновкиДанных.Больше);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "СтатусЗадания", Перечисления.СтатусыЗаданий.Завершено, 
			ВидСравненияКомпоновкиДанных.НеРавно);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Список, "НеудачныхПопытокВыполнения");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Список, "СтатусЗадания");
		
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ОтборНевыполненныеНаСервере()
	
	Элементы.СписокОтборНевыполненные.Пометка = ЕстьОтборНевыполненные;
	
	Если ЕстьОтборНевыполненные Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;	
	
	Если ЕстьОтборНевыполненные Тогда
		
		// Статус <> Завершено
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "СтатусЗадания", Перечисления.СтатусыЗаданий.Завершено, 
			ВидСравненияКомпоновкиДанных.НеРавно);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Список, "СтатусЗадания");
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНевыполненные(Команда)           
	
	Если Не ЕстьОтборНевыполненные Тогда
		ПредыдущийРежимСписка = Элементы.Список.Отображение;
	КонецЕсли;	
	
	ЕстьОтборНевыполненные = Не ЕстьОтборНевыполненные;
	
	Если ЕстьОтборНевыполненные Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	ИначеЕсли ПредыдущийРежимСписка <> Неопределено Тогда	
		Элементы.Список.Отображение = ПредыдущийРежимСписка;
	КонецЕсли;	
	
	ОтборНевыполненныеНаСервере();
КонецПроцедуры

&НаКлиенте
Функция ТекстСообщенияОбработкаВДругихУзлах(ЗаданийДляОбработкиВДругихУзлах)
	
	ТекстСообщения = "";

	Возврат ТекстСообщения;
	
КонецФункции

// Возвращает, требует ли статус задания его обработки
// 
// Параметры:
//  Статус - ПеречислениеСсылка.СтатусыЗаданий
// 
// Возвращаемое значение:
//  Булево
&НаКлиентеНаСервереБезКонтекста
Функция СтатусТребуетОбработки(Статус)
	
	Возврат Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаданий.Выполняется")
		Или Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаданий.ОжидаетЗавершенияПодчиненных");
	
КонецФункции

#КонецОбласти
